## Plan Result (prod-prod)




<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.claim-employment-tribunals.azurerm_dns_cname_record.this[&#34;afdverify.et-sya&#34;]
  * module.claim-employment-tribunals.azurerm_dns_cname_record.this[&#34;cdnverify.et-sya&#34;]
  * module.claim-employment-tribunals.azurerm_dns_cname_record.this[&#34;et-sya&#34;]
  * module.claim-employment-tribunals.azurerm_dns_zone.zone
  * module.claim-employment-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.respond-employment-tribunals.azurerm_dns_cname_record.this[&#34;afdverify.et-ra&#34;]
  * module.respond-employment-tribunals.azurerm_dns_cname_record.this[&#34;cdnverify.et-ra&#34;]
  * module.respond-employment-tribunals.azurerm_dns_cname_record.this[&#34;et-ra&#34;]
  * module.respond-employment-tribunals.azurerm_dns_zone.zone
  * module.respond-employment-tribunals.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.claim-employment-tribunals.azurerm_dns_cname_record.this["afdverify.et-sya"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.et-sya"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "claim-employment-tribunals.service.gov.uk"
    }

  # module.claim-employment-tribunals.azurerm_dns_cname_record.this["cdnverify.et-sya"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.et-sya"
      + record              = "cdnverify.hmcts-et-sya-shutter-prod.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "claim-employment-tribunals.service.gov.uk"
    }

  # module.claim-employment-tribunals.azurerm_dns_cname_record.this["et-sya"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "et-sya"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "claim-employment-tribunals.service.gov.uk"
    }

  # module.claim-employment-tribunals.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "claim-employment-tribunals.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.claim-employment-tribunals.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.respond-employment-tribunals.azurerm_dns_cname_record.this["afdverify.et-ra"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.et-ra"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "respond-employment-tribunals.service.gov.uk"
    }

  # module.respond-employment-tribunals.azurerm_dns_cname_record.this["cdnverify.et-ra"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.et-ra"
      + record              = "cdnverify.hmcts-et-ra-shutter-prod.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "respond-employment-tribunals.service.gov.uk"
    }

  # module.respond-employment-tribunals.azurerm_dns_cname_record.this["et-ra"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "et-ra"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "respond-employment-tribunals.service.gov.uk"
    }

  # module.respond-employment-tribunals.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "respond-employment-tribunals.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.respond-employment-tribunals.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":972,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->